
&НаКлиенте
Процедура Объединение(Команда)
	ОбъединениеНаСервере();
КонецПроцедуры
&НаСервере
Процедура ОбъединениеНаСервере()
	ТЗ = Новый ТаблицаЗначений();
	ТЗ = Объект.Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура","Количество");
	Объект.Товары.Загрузить(ТЗ);
КонецПроцедуры
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьСумму(Строка)
	Строка.Сумма = Строка.Цена * Строка.Количество;
КонецПроцедуры
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры
#КонецОбласти