
&НаКлиенте
Процедура Объединение(Команда)
	ОбъединениеНаСервере();
КонецПроцедуры
&НаСервере
Процедура ОбъединениеНаСервере()
	ТЗ = Новый ТаблицаЗначений();
	ТЗ = Объект.Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура","Количество");
	Объект.Товары.Загрузить(ТЗ);
КонецПроцедуры
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьСумму(Строка)
	Строка.Сумма = Строка.Цена * Строка.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Цена = ПолучитьЦену(Элементы.Товары.ТекущиеДанные.Номенклатура);
	ТоварыЦенаПриИзменении(Элементы.Товары.ТекущиеДанные.Цена);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти
&НаСервереБезКонтекста
Функция ПолучитьЦену(Товар)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Цена
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ 
	|  ССылка =&АБВ";
	Запрос.УстановитьПараметр("АБВ",Товар);
	Результат= Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Цена;
КонецФункции