#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьСумму(Строка)
	Строка.Сумма = Строка.Цена * Строка.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Цена = ПолучитьЦену(Элементы.Товары.ТекущиеДанные.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДатьСкидку(Команда)
	ДатьСкидкуНаСервере();
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДатьСкидкуНаСервере()
	Для Каждого Стр Из Объект.Товары Цикл
		Стр.Цена = Стр.Цена*0.9;
		РасчитатьСумму(Стр);
	КонецЦикла;
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьЦену(Товар)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Цена
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ 
	|  ССылка =&АБВ";
	Запрос.УстановитьПараметр("АБВ",Товар);
	Результат= Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ЦенаПродажи;
КонецФункции
#КонецОбласти