#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьСумму(Строка)
	Строка.Сумма = Строка.Цена * Строка.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Цена = ПолучитьЦену(Элементы.Товары.ТекущиеДанные.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДатьСкидку(Команда)
	ДатьСкидкуНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Печать1(Команда)
	ТабДок = Печать1НаСервере();
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция Печать1НаСервере()
	ТабДок = Новый ТабличныйДокумент();
	Макет = Документы.СчетНаОплату.ПолучитьМакет("Макет");
	ОблШапка = Макет.ПолучитьОбласть("ОблШапка");
	ОблСтрока = Макет.ПолучитьОбласть("ОблСтрока");
	ОблПодвал = Макет.ПолучитьОбласть("ОблПодвал");
	ОблШапка.Параметры.Номер = Объект.Номер;
	ОблШапка.Параметры.Дата = Формат(Объект.Дата, "Л=ru; ДЛФ=DD;");
	ОблШапка.Параметры.Контрагент = Объект.Контрагент;
	ОблШапка.Параметры.Договор = Объект.Договор;
	ТабДок.Вывести(ОблШапка);
	Для Каждого Стр Из Объект.Товары Цикл
		ОблСтрока.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла; 
ОблПодвал.Параметры.СуммаПрописью= ЧислоПрописью(Объект.Товары.Итог("Сумма"),,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
ТабДок.Вывести(ОблПодвал);	
ТабДок.ОтображатьГруппировки = Ложь;
ТабДок.ОтображатьЗаголовки = Ложь;
ТабДок.ОтображатьСетку = Ложь;
	Возврат ТабДок;
КонецФункции
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДатьСкидкуНаСервере()
	Для Каждого Стр Из Объект.Товары Цикл
		Стр.Цена = Стр.Цена*0.9;
		РасчитатьСумму(Стр);
	КонецЦикла;
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьЦену(Товар)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Цена
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ 
	|  ССылка =&АБВ";
	Запрос.УстановитьПараметр("АБВ",Товар);
	Результат= Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Цена;
КонецФункции
#КонецОбласти