#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьСумму(Строка)
	Строка.Сумма = Строка.Цена * Строка.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Цена = ПолучитьЦену(Элементы.Товары.ТекущиеДанные.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры
&НаКлиенте
Процедура ДатьСкидку(Команда)
	ДатьСкидкуНаСервере();
КонецПроцедуры
#КонецОбласти




#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДатьСкидкуНаСервере()
	Для Каждого Стр Из Объект.Товары Цикл
		Стр.Цена = Стр.Цена*0.9;
		РасчитатьСумму(Стр);
	КонецЦикла;
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьЦену(Товар)
	Возврат Товар.Цена;
КонецФункции
#КонецОбласти