Процедура ОбработкаПроведения(Отказ,Режим)
	Движения.ОстаткиТоваров.Записывать = Истина;
	ТЗ = Новый ТаблицаЗначений();
	ТЗ = Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура","Количество");
	
	Для Каждого ТекСтрокаТовары Из ТЗ Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
Движения.Записать();
Запрос =Новый Запрос();
Запрос.Текст =
"ВЫБРАТЬ
|	ОстаткиТоваровОстатки.Номенклатура,
|	ОстаткиТоваровОстатки.КоличествоОстаток
|ИЗ
|	РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени, Склад = &Склад) КАК ОстаткиТоваровОстатки
|ГДЕ
|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
//|	И ОстаткиТоваровОстатки.Склад = &Склад";
Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая);
Запрос.УстановитьПараметр("МоментВремени", Граница);
Запрос.УстановитьПараметр("Склад", Склад);
РезультатЗапроса = Запрос.Выполнить();
Если Не РезультатЗапроса.Пустой() Тогда
  Отказ= Истина;
  Выборка = РезультатЗапроса.Выбрать();
  Пока Выборка.Следующий() Цикл
  	   Сообщить("Мало товара "+ Выборка.Номенклатура + ", нужно еще "+ (-Выборка.КоличествоОстаток));
  	   КонецЦикла;
КонецЕсли;
КонецПроцедуры