Процедура ОбработкаПроведения(Отказ,Режим)
	Движения.ОстаткиТоваров.Записывать = Истина;
	ТЗ = Новый ТаблицаЗначений();
	ТЗ = Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура","Количество");
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
Движения.Записать();
Запрос =Новый Запрос();
Запрос.Текст =
"ВЫБРАТЬ
|	ОстаткиТоваровОстатки.Номенклатура,
|	ОстаткиТоваровОстатки.КоличествоОстаток
|ИЗ
|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
|ГДЕ
|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
РезультатЗапроса = Запрос.Выполнить();
Если Не РезультатЗапроса.Пустой() Тогда
  Отказ= Истина;
КонецЕсли
КонецПроцедуры